submission_logs/2_2_two_middlewares/16/4/1-0/0/memtier/3.log
1         Threads
4         Connections per thread
80        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1376.24          ---          ---      2.90300      5559.23 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1376.24         0.00         0.00      2.90300      5559.23 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.540         0.00
SET       0.550         0.00
SET       0.560         0.01
SET       0.570         0.01
SET       0.580         0.01
SET       0.590         0.02
SET       0.600         0.02
SET       0.610         0.04
SET       0.620         0.05
SET       0.630         0.07
SET       0.640         0.08
SET       0.650         0.10
SET       0.660         0.13
SET       0.670         0.16
SET       0.680         0.19
SET       0.690         0.24
SET       0.700         0.30
SET       0.710         0.37
SET       0.720         0.43
SET       0.730         0.51
SET       0.740         0.61
SET       0.750         0.71
SET       0.760         0.85
SET       0.770         0.99
SET       0.780         1.12
SET       0.790         1.26
SET       0.800         1.42
SET       0.810         1.60
SET       0.820         1.79
SET       0.830         2.01
SET       0.840         2.24
SET       0.850         2.52
SET       0.860         2.83
SET       0.870         3.12
SET       0.880         3.43
SET       0.890         3.78
SET       0.900         4.12
SET       0.910         4.46
SET       0.920         4.83
SET       0.930         5.25
SET       0.940         5.68
SET       0.950         6.10
SET       0.960         6.56
SET       0.970         7.05
SET       0.980         7.55
SET       0.990         8.06
SET       1.000        11.17
SET       1.100        17.65
SET       1.200        25.00
SET       1.300        32.66
SET       1.400        40.18
SET       1.500        47.19
SET       1.600        53.40
SET       1.700        58.59
SET       1.800        63.05
SET       1.900        66.89
SET       2.000        70.14
SET       2.100        72.73
SET       2.200        74.87
SET       2.300        76.70
SET       2.400        78.23
SET       2.500        79.43
SET       2.600        80.53
SET       2.700        81.50
SET       2.800        82.24
SET       2.900        82.92
SET       3.000        83.53
SET       3.100        84.07
SET       3.200        84.56
SET       3.300        84.93
SET       3.400        85.26
SET       3.500        85.58
SET       3.600        85.88
SET       3.700        86.13
SET       3.800        86.35
SET       3.900        86.58
SET       4.000        86.77
SET       4.100        86.95
SET       4.200        87.09
SET       4.300        87.25
SET       4.400        87.37
SET       4.500        87.48
SET       4.600        87.58
SET       4.700        87.67
SET       4.800        87.78
SET       4.900        87.89
SET       5.000        87.97
SET       5.100        88.05
SET       5.200        88.13
SET       5.300        88.21
SET       5.400        88.29
SET       5.500        88.37
SET       5.600        88.43
SET       5.700        88.49
SET       5.800        88.56
SET       5.900        88.63
SET       6.000        88.71
SET       6.100        88.76
SET       6.200        88.82
SET       6.300        88.90
SET       6.400        88.97
SET       6.500        89.05
SET       6.600        89.14
SET       6.700        89.25
SET       6.800        89.38
SET       6.900        89.54
SET       7.000        89.75
SET       7.100        90.01
SET       7.200        90.32
SET       7.300        90.70
SET       7.400        91.08
SET       7.500        91.53
SET       7.600        92.05
SET       7.700        92.59
SET       7.800        93.15
SET       7.900        93.70
SET       8.000        94.26
SET       8.100        94.80
SET       8.200        95.38
SET       8.300        95.90
SET       8.400        96.37
SET       8.500        96.83
SET       8.600        97.25
SET       8.700        97.57
SET       8.800        97.83
SET       8.900        98.06
SET       9.000        98.26
SET       9.100        98.41
SET       9.200        98.53
SET       9.300        98.69
SET       9.400        98.81
SET       9.500        98.95
SET       9.600        99.08
SET       9.700        99.16
SET       9.800        99.22
SET       9.900        99.27
SET      10.000        99.47
SET      11.000        99.61
SET      12.000        99.69
SET      13.000        99.73
SET      14.000        99.77
SET      15.000        99.79
SET      16.000        99.80
SET      17.000        99.82
SET      18.000        99.83
SET      19.000        99.84
SET      20.000        99.84
SET      22.000        99.84
SET      23.000        99.84
SET      27.000        99.84
SET      30.000        99.84
SET      35.000        99.84
SET      37.000        99.84
SET      38.000        99.85
SET      39.000        99.85
SET      40.000        99.85
SET      48.000        99.85
SET      49.000        99.85
SET      55.000        99.85
SET      57.000        99.85
SET      61.000        99.85
SET      64.000        99.86
SET      65.000        99.86
SET      67.000        99.86
SET      71.000        99.86
SET      73.000        99.87
SET      74.000        99.87
SET      77.000        99.87
SET      80.000        99.87
SET      81.000        99.87
SET      82.000        99.87
SET      84.000        99.87
SET      85.000        99.87
SET      88.000        99.88
SET      89.000        99.88
SET      90.000        99.88
SET      91.000        99.88
SET      92.000        99.88
SET      93.000        99.88
SET      94.000        99.89
SET      96.000        99.89
SET      98.000        99.89
SET     110.000        99.89
SET     120.000        99.89
SET     130.000        99.89
SET     140.000        99.90
SET     150.000        99.90
SET     160.000        99.91
SET     170.000        99.92
SET     180.000        99.92
SET     200.000        99.92
SET     210.000        99.93
SET     220.000        99.93
SET     230.000        99.93
SET     240.000        99.93
SET     250.000        99.94
SET     260.000        99.94
SET     270.000        99.94
SET     300.000        99.94
SET     320.000        99.94
SET     330.000        99.95
SET     340.000        99.95
SET     350.000        99.95
SET     360.000        99.95
SET     370.000        99.95
SET     390.000        99.95
SET     400.000        99.96
SET     430.000        99.96
SET     440.000        99.96
SET     450.000        99.96
SET     460.000        99.96
SET     470.000        99.96
SET     490.000        99.97
SET     510.000        99.97
SET     530.000        99.97
SET     540.000        99.97
SET     550.000        99.97
SET     560.000        99.97
SET     570.000        99.97
SET     580.000        99.98
SET     590.000        99.98
SET     620.000        99.98
SET     630.000        99.98
SET     670.000        99.98
SET     680.000        99.98
SET     690.000        99.98
SET     700.000        99.99
SET     710.000        99.99
SET     730.000        99.99
SET     800.000        99.99
SET     820.000        99.99
SET     860.000        99.99
SET     920.000        99.99
SET     930.000        99.99
SET     940.000        99.99
SET     960.000       100.00
SET     990.000       100.00
SET    1000.000       100.00
SET    1200.000       100.00
---
---